{
  "i18n.title": "codezhang resume",
  "i18n.banner.name": "My name is codezhang(hongli.zhang)",
  "i18n.graduate": "Web front-end development engineer, graduated from computer college in 2014.",
  "i18n.about": "About Me",
  "i18n.nav": "Navigation",
  "i18n.home": "Home",
  "i18n.skill": "Skills",
  "i18n.experience": "Experience",
  "i18n.contact": "Contact",
  "i18n.description.title": "I am a front-end development engineer in Beijing. I graduated from school of computer science, Inner Mongolia agricultural university in 2014. I joined an archive software company in June 2014. At the end of 2015, I came to Beijing to officially engage in front-end development, and now I have more than three years of front-end development experience.",
  "i18n.description.one": "I have a solid foundation of front-end development and always keep a passion for learning new technologies. Proficient in HTML5, CSS3 and JavaScript(React,Typescript); Popular front-end development frameworks, such as AntdDesign, Redux and Bizcharts have practical development projects; Proficient in front-end development tools, such as gulp. js, Seajs, WebPack and Less, etc. I learned AngularJS and React, but I prefer the lightweight, high-performance, componentized MVVM framework React. Js, which is used in actual development projects. I learned node. js(Express), ECMAScript6 and other technologies, hoping to improve the practice in future development projects.",
  "i18n.description.hobby": "Love reading, love listening to music, love swimming, love running, love climbing. Code is not life.",
  "i18n.github": "Go to my GitHub",
  "i18n.feeling": "Front-end development requires continuous and long-term learning, an adequate knowledge base in various fields, and a passion for learning new technologies. The most important piece of the front-end development engineer technology stack is native JavaScript, which I've read through several times in advanced JavaScript programming and the definitive guide to JavaScript, and recently re-read the JavaScript language essentials.",
  "i18n.experience.info": "Graduated from Inner Mongolia agricultural university, I started my career as a front-end development engineer in 2016. After that, my first job was in the medical industry. During my tenure, I continued to learn javascript while completing my personal tasks. Meanwhile, the company is an American enterprise, which advocates the React system, thus opening the door of my React. With the emergence of front-end es6, front-end pays more attention to engineering and componentization, and the threshold of front-end becomes higher and higher. Many frameworks also emerge, front-end refueling!",
  "i18n.tonow": "Up to now",
  "i18n.company.now": "Shenzhen rihai intelligent co. LTD",
  "i18n.company.aoyi": "Beijing aoyisheng network technology co., LTD",
  "i18n.aoyi.info": "I've been using React all this time,Typescript development project, in addition to web side and mobile side development tasks, the operation will also raise some temporary activity requirements. We also write H5 pages, during which we always pay attention to the latest developments of the front end, and generally study in the nuggets community",
  "i18n.company.feidakang": "American feidakon co., LTD",
  "i18n.feidakang.info": "This is a time when my front-end development skills have improved a lot. The company has three front end, the company's official website, new medical projects, old projects daily maintenance, management background page optimization, and so on have done some. The work is very saturated, but I have learned a lot of new frameworks and libraries in my spare time, and I have a certain understanding of AngularJS and React, while I choose the lightweight, high-performance and component-based React",
  "i18n.company.taitan": "Zhuhai Titan software system co. LTD",
  "i18n.taitan.info": "Daily work around the file system management page preparation, development of the company's background page, official website and some PC side pages. In my spare time, I actively learned and mastered many technologies, such as Jquery, Less and Bootstrap3.cars only I started to learn the open source framework on GitHub and share my learning experience, which improved my understanding and cognition of native JavaScript.",
  "i18n.web.hero": "Front-end development engineer",
  "i18n.continued": "To be continued...",
  "i18n.designer": "Web Designer",
  "i18n.school": "Inner Mongolia agricultural university",
  "i18n.colleges": "College of computer science undergraduate",
  "i18n.eamil": "Email",
  "i18n.school.learn": "During the four years of college life, I mainly learned operating system, computer network, C/C++ programming language, data structure, compilation principle, introduction to software engineering and so on. In October 2013, I began to learn front-end development by myself. Before graduation, I learned HTML, CSS and jQuery by myself, and laid a good foundation of native JavaScript."
}
